In [1]:
import pandas as pd

In [ ]:
# Create

In [2]:
# A DataFrame is a table.

pd.DataFrame({"yes":[23,56],"no":[1,89]})

   yes  no
0   23   1
1   56  89

In [6]:
# The dictionary-list constructor assigns values to the column labels, but just uses 
# an ascending count from 0 (0, 1, 2, 3, ...) for the row labels.

pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 'Sue': ['Pretty good.', 'Bland.']})

             Bob           Sue
0    I liked it.  Pretty good.
1  It was awful.        Bland.

In [7]:
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 'Sue': ['Pretty good.', 'Bland.']},
            index=['+ve feedback','-ve feedback'])

                        Bob           Sue
+ve feedback    I liked it.  Pretty good.
-ve feedback  It was awful.        Bland.

Series

In [8]:
# A Series, by contrast, is a sequence of data values. If a DataFrame is a table, a Series is a list.
# And in fact you can create one with nothing more than a list:

pd.Series([4,5,7,89,0])

0     4
1     5
2     7
3    89
4     0
dtype: int64

In [9]:
pd.Series([30, 35, 40], index=['2015 Sales', '2016 Sales', '2017 Sales'], name='Product A')

2015 Sales    30
2016 Sales    35
2017 Sales    40
Name: Product A, dtype: int64

In [15]:
pd.Series(name = "prashant",dtype = "string")

Series([], Name: prashant, dtype: string)

In [ ]:
# Read

In [16]:
movies = pd.read_csv("imdb-top-1000.csv")

In [17]:
movies.shape

(1000, 10)

In [18]:
movies.head()
# Here new col index will be created automatically

,Series_Title,Released_Year,Runtime,Genre,IMDB_Rating,Director,Star1,No_of_Votes,Gross,Metascore
0,The Shawshank Redemption,1994,142,Drama,9.3,Frank Darabont,Tim Robbins,2343110,28341469.0,80.0
1,The Godfather,1972,175,Crime,9.2,Francis Ford Coppola,Marlon Brando,1620367,134966411.0,100.0
2,The Dark Knight,2008,152,Action,9.0,Christopher Nolan,Christian Bale,2303232,534858444.0,84.0
3,The Godfather: Part II,1974,202,Crime,9.0,Francis Ford Coppola,Al Pacino,1129952,57300000.0,90.0
4,12 Angry Men,1957,96,Crime,9.0,Sidney Lumet,Henry Fonda,689845,4360000.0,96.0

In [37]:
# Here new col index will not be created automatically,because of index_col=0
mov = pd.read_csv("imdb-top-1000.csv",index_col=0)
# index_col is used to specify index_col by perticular col
# mov = pd.read_csv("imdb-top-1000.csv",index_col=4)

mov.head()

,Released_Year,Runtime,Genre,IMDB_Rating,Director,Star1,No_of_Votes,Gross,Metascore
Series_Title,,,,,,,,,
The Shawshank Redemption,1994,142,Drama,9.3,Frank Darabont,Tim Robbins,2343110,28341469.0,80.0
The Godfather,1972,175,Crime,9.2,Francis Ford Coppola,Marlon Brando,1620367,134966411.0,100.0
The Dark Knight,2008,152,Action,9.0,Christopher Nolan,Christian Bale,2303232,534858444.0,84.0
The Godfather: Part II,1974,202,Crime,9.0,Francis Ford Coppola,Al Pacino,1129952,57300000.0,90.0
12 Angry Men,1957,96,Crime,9.0,Sidney Lumet,Henry Fonda,689845,4360000.0,96.0

In [23]:
# Exercise

In [26]:
fruit_sales = pd.DataFrame({'apple':[35,41],'bananas':[21,34]},index=["2017 Sales","2018 sales"])

In [27]:
fruit_sales

            apple  bananas
2017 Sales     35       21
2018 sales     41       34

In [32]:
ingrediants=pd.Series(["4 cup","1 cup","2 cup","1 cup"],index=["flour","milk","egg","spam"],name="Dinner")
ingrediants

flour    4 cup
milk     1 cup
egg      2 cup
spam     1 cup
Name: Dinner, dtype: object